IdeaRS.OpenModel.Model.SupportTypeInDirrection
Type opf support in the direction

IdeaRS.OpenModel.Model.SupportTypeInDirrection.Rigid
Rigid support

IdeaRS.OpenModel.Model.SupportTypeInDirrection.Free
Free support (no support defined)

IdeaRS.OpenModel.Model.SupportTypeInDirrection.Flexible
Flexible support (Flexible Stiffness is present)

IdeaRS.OpenModel.Model.SupportTypeInDirrection.RigidPressOnly
Nonlinear press only

IdeaRS.OpenModel.Model.SupportTypeInDirrection.FlexiblePressOnly
Nonlinear flexible press only